Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
					<Comment>DataCollectionTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеВесы</Name>
					<Comment>Scale</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесыСПечатьюЭтикеток</Name>
					<Comment>ScaleOffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьККМОфлайн</Name>
					<Comment>ECROffline</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЭтикеток</Name>
					<Comment>LabelPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособПодключенияДрайвера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СпособПодключенияДрайвера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзМакета</Name>
					<Comment>Установка драйвера осуществляется из макета конфигурации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛокальноПоИдентификатору</Name>
					<Comment>Подключатся драйвер, установленный на локальном компьютере по ProgID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзИнформационнойБазы</Name>
					<Comment>Установка драйвера осуществляется из информационной базы</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОборудованиеУстройстваВводаОбновление/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Добавляет в список поставляемые драйверы в составе конфигурации.
//
// Параметры:
//  ДрайвераОборудования - см. МенеджерОборудования.НоваяТаблицаПоставляемыхДрайверовОборудования
//
Процедура ОбновитьПоставляемыеДрайвера(ДрайвераОборудования) Экспорт
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода;
	Драйвер.ИмяДрайвера  = "Драйвер1ССканерыШтрихкодаNative";
	Драйвер.Наименование = НСтр("ru = '1С:Сканеры штрихкода (Native Api)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "InputDevice"; 
	Драйвер.ВерсияДрайвера = "10.4.2.4";
	Драйвер.ИмяМакетаДрайвера = "Драйвер1СУстройстваВводаNative";
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода;
	Драйвер.ИмяДрайвера  = "ДрайверГексагонСканерыШтрихкода";
	Драйвер.Наименование = НСтр("ru = 'Гексагон:Сканеры штрихкода Proton'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ProtonScanner"; 
	Драйвер.СнятСПоддержки = Истина; 
	Драйвер.СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзИнформационнойБазы;
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода;
	Драйвер.ИмяДрайвера  = "ДрайверАтолСканерыШтрихкода8X";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:Сканеры штрихкода 8.X'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ATOL_Scaners_1CInt"; 
	Драйвер.ИмяМакетаДрайвера = "ДрайверАТОЛУстройстваВвода8X";
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт;
	Драйвер.ИмяДрайвера  = "ДрайверАтолСчитывателиМагнитныхКарт8X";
	Драйвер.Наименование = НСтр("ru = 'АТОЛ:Считыватели магнитных карт 8.X'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ATOL_Scaners_1CInt"; 
	Драйвер.ИмяМакетаДрайвера = "ДрайверАТОЛУстройстваВвода8X";
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт;
	Драйвер.ИмяДрайвера  = "Драйвер1ССчитывателиМагнитныхКартNative";
	Драйвер.Наименование = НСтр("ru = '1С:Считыватели магнитных карт (Native Api)'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "InputDevice"; 
	Драйвер.ВерсияДрайвера = "10.4.2.4";
	Драйвер.ИмяМакетаДрайвера = "Драйвер1СУстройстваВводаNative";
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт;
	Драйвер.ИмяДрайвера  = "ДрайверIronLogicСчитывателиБесконтактныхКарт";
	Драйвер.Наименование = НСтр("ru = 'Iron Logic:Считыватели бесконтактных карт Z-2'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "ZR1CExtension"; 
	Драйвер.ВерсияДрайвера = "1.5.2.1"; 
	
	Драйвер = ДрайвераОборудования.Добавить();
	Драйвер.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт;
	Драйвер.ИмяДрайвера  = "ДрайверРусГардСчитывательМагнитныхКарт";
	Драйвер.Наименование = НСтр("ru = 'Рус-Гард:Считыватель магнитных карт'", ОбщегоНазначения.КодОсновногоЯзыка());
	Драйвер.ИдентификаторОбъекта = "RgReaderExtension"; 
	Драйвер.ВерсияДрайвера = "4.1"; 
	
КонецПроцедуры

#КонецОбласти
